# Python Data Analysis Library - Pandas II
# 1. Goupby I
### 1.1 Groupby 
- SQL goupby 명령어와 동일
- split -> apply -> combine
- 과정을 거쳐 연산함
- index가 같은 것끼리 data 묶어줌

In [1]:
import pandas as pd

In [21]:
# data from :
ipl_data = {
    "Team" : ["Riders", "Riders", "Devils", "Devils", "Kings", "Kings", "Kings", "Kings", "Riders", "Royals", "Royals", "Riders"],
    "Rank" : [1,2,2,3,3,4,1,1,2,4,1,2],
    "Year" : [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
    "Points" : [876,769,863,673,741,812,756,788,694,701,804,690]
}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     769
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

1.1.1 Group by - basic

> df.groupby("묶음기준 Column")["적용 받는 Column"].적용받는 연산() <br>  
=> 결과 : 묶음기준 Column을 기준으로 적용 받는 Column을 연산

In [12]:
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Riders    3029
Royals    1505
kings     3097
Name: Points, dtype: int64

In [14]:
df.groupby("Team")["Points"].mean()
# df.groupby("Team")["Points"].std()

Team
Devils    768.00
Riders    757.25
Royals    752.50
kings     774.25
Name: Points, dtype: float64

### 1.2 Hierarchical index
- 한 개이상의 Column 묶기 가능
- Groupby 명령의 결과물도 결국은 dataframe
- 두 개의 column으로 groupby를 할 경우, index가 두개 생성

> df.groupby(["기준1","기준2"])["연산할 column"].연산()

In [22]:
h_index = df.groupby(["Team","Year"])["Points"].sum()
h_index

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    769
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [19]:
h_index.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015),
            ( 'kings', 2014),
            ( 'kings', 2015),
            ( 'kings', 2016),
            ( 'kings', 2017)],
           names=['Team', 'Year'])

In [23]:
h_index["Devils":"Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Name: Points, dtype: int64

### 1.3 Hierarchical index - unstack()
- Group으로 묶여진 data를 matrix 형태로 전환시켜줌

In [24]:
h_index.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0  812.0  756.0  788.0
Riders  876.0  769.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN

In [25]:
h_index.unstack().stack()

Team    Year
Devils  2014    863.0
        2015    673.0
Kings   2014    741.0
        2015    812.0
        2016    756.0
        2017    788.0
Riders  2014    876.0
        2015    769.0
        2016    694.0
        2017    690.0
Royals  2014    701.0
        2015    804.0
dtype: float64

In [27]:
# 앞의 index를 없애주기
h_index.reset_index()

      Team  Year  Points
0   Devils  2014     863
1   Devils  2015     673
2    Kings  2014     741
3    Kings  2015     812
4    Kings  2016     756
5    Kings  2017     788
6   Riders  2014     876
7   Riders  2015     769
8   Riders  2016     694
9   Riders  2017     690
10  Royals  2014     701
11  Royals  2015     804

### 1.4 Hierarchical index - swaplevel
- index level 변경 가능

In [31]:
# column 1,2 순서 바껴서 출력
h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2015  Kings     812
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    769
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
Name: Points, dtype: int64

In [35]:
# level 1을 기준으로 sort
h_index.sort_index(level = 1)

Team    Year
Devils  2014    863
Kings   2014    741
Riders  2014    876
Royals  2014    701
Devils  2015    673
Kings   2015    812
Riders  2015    769
Royals  2015    804
Kings   2016    756
Riders  2016    694
Kings   2017    788
Riders  2017    690
Name: Points, dtype: int64

In [36]:
# level 0을 기준으로 sort
h_index.sort_index(level = 0)

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Riders  2014    876
        2015    769
        2016    694
        2017    690
Royals  2014    701
        2015    804
Name: Points, dtype: int64

In [39]:
# 맨 오른쪽 value기준으로 sort
h_index.sort_values()

Team    Year
Devils  2015    673
Riders  2017    690
        2016    694
Royals  2014    701
Kings   2014    741
        2016    756
Riders  2015    769
Kings   2017    788
Royals  2015    804
Kings   2015    812
Devils  2014    863
Riders  2014    876
Name: Points, dtype: int64

In [41]:
# Series Data임!
type(h_index)

pandas.core.series.Series

### 1.5 Hierarchical index - operations
- index level을 기준으로 기본 연산 수행 가능

In [42]:
h_index.sum(level=0)

C:\Users\pknu\AppData\Local\Temp\ipykernel_11032\1316823663.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  h_index.sum(level=0)

Team
Devils    1536
Kings     3097
Riders    3029
Royals    1505
Name: Points, dtype: int64

In [43]:
h_index.sum(level=1)

C:\Users\pknu\AppData\Local\Temp\ipykernel_11032\3361406207.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  h_index.sum(level=1)

Year
2014    3181
2015    3058
2016    1450
2017    1478
Name: Points, dtype: int64

# 2. Groupby II
### 2.1 Groupby - grouped
- Groupby에 의해 Split된 상태를 추출 가능
- Tuple 형태로 그룹의 key 값 value값이 추출됨
- 추출된 group 정보에는 세가지 유형의 apply 가능
- Aggregation : 요약된 통계 정보 추출
- Transformation : 해당 정보 변환 (lambda funtion 사용)
- Filtration : 특정 정보를 제거해서 보여주는 필터링 기능

In [44]:
grouped = df.groupby("Team") # Team ; group 기준

for name, group in grouped :
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
5  Kings     4  2015     812
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     769
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

- 특정 key값을 가진 그룹의 정보만 추출 가능

In [45]:
grouped.get_group("Devils")

     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673

### 2.2 Groupby - aggregation
- column 별로 계산 해줌

In [46]:
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      9  8062    3097
Riders     7  8062    3029
Royals     5  4029    1505

In [47]:
import numpy as np
grouped.agg(np.mean)

        Rank    Year  Points
Team
Devils  2.50  2014.5  768.00
Kings   2.25  2015.5  774.25
Riders  1.75  2015.5  757.25
Royals  2.50  2014.5  752.50

- 특정 column에 여러 개의 funciton을 apply 가능

In [48]:
grouped["Points"].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3029  757.25   87.106735
Royals  1505  752.50   72.831998

In [50]:
# 각 column별 max 추출
grouped.agg(max)

        Rank  Year  Points
Team
Devils     3  2015     863
Kings      4  2017     812
Riders     2  2017     876
Royals     4  2015     804

### 2.3 Groupby - Transformation
- Aggregation과 달리 key값 별로 요약된 정보 X
- 개별 data의 변환 지원

In [51]:
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     769
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [52]:
# Team으로 group된 상태
score = lambda x: (x)
grouped.transform(score)

    Rank  Year  Points
0      1  2014     876
1      2  2015     769
2      2  2014     863
3      3  2015     673
4      3  2014     741
5      4  2015     812
6      1  2016     756
7      1  2017     788
8      2  2016     694
9      4  2014     701
10     1  2015     804
11     2  2017     690

- 단, Max or Min처럼 Series data에 적용되는 data들은 key 값을 기준으로 Grouped된 데이터 기준

In [53]:
score = lambda x: (x.max())
grouped.transform(score)
# 그룹되어 있는 column기준으로 그룹내에서의 각 column에 대한 MAX를 각 column의 element에 all 적용

    Rank  Year  Points
0      2  2017     876
1      2  2017     876
2      3  2015     863
3      3  2015     863
4      4  2017     812
5      4  2017     812
6      4  2017     812
7      4  2017     812
8      2  2017     876
9      4  2015     804
10     4  2015     804
11     2  2017     876

In [54]:
score = lambda x: (x - x.mean()) / x.std()
grouped.transform(score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.363270
1   0.500000 -0.387298  0.134892
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   0.500000 -1.161895 -1.042333
5   1.166667 -0.387298  1.183401
6  -0.833333  0.387298 -0.572108
7  -0.833333  1.161895  0.431040
8   0.500000  0.387298 -0.726121
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.772041

In [56]:
# 기존 data
grouped.transform(lambda x : x)

    Rank  Year  Points
0      1  2014     876
1      2  2015     769
2      2  2014     863
3      3  2015     673
4      3  2014     741
5      4  2015     812
6      1  2016     756
7      1  2017     788
8      2  2016     694
9      4  2014     701
10     1  2015     804
11     2  2017     690

### Groupby - filter
- 특정 조건으로 data 검색 시 사용
- filter 안에는 boolean 조건이 존재해야 함
- len(x)는 grouped된 dataframe 개수

In [59]:
df["Team"].value_counts()

Riders    4
Kings     4
Devils    2
Royals    2
Name: Team, dtype: int64

In [57]:
# Group된 데이터의 개수가 3보다 큰 그룹 출력
df.groupby("Team").filter(lambda x : len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     769
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [58]:
# Team별로 그룹해서 그룹된 Rank의 합이 2보다 큰 그룹만 추출
df.groupby("Team").filter(lambda x : x["Rank"].sum() > 2)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     769
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    Kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690